# 1. შექმენით 2 ცვლადი, ერთში შეინახეთ ინტეჯერი, მეორეში სტრინგი და დაპრინტეთ მათი ჯამი, შედეგი უნდა იყოს ინტეჯერი.

num1 = 4
num2 = "5"

print(4+int(num2))

# 2. შექმენით 2 ცვლადი, ერთში შეინახეთ ინტეჯერი, მეორეში სტრინგი და დაპრინტეთ მათი ჯამი, შედეგი უნდა იყოს სტრინგი.

num3 = 2
num4 = "5"

print(str(2) + "5")

# 3. მომხმარებელს input-ის მეშვეობით შემოატანინეთ რიცხვი, შემდეგ შექმენით ცვლადი, სადაც შეინახავთ რამე სხვა ციფრს,
#  ბოლოს დაპრინტეთ input-ში შემოტანილი ციფრის და თქვემი ცვლადის ჯამი.

num5 = input("Number: ")
num6 = 6

print(int(num5) + int(num6))