# 1. შექმენით ცვლადი, სადაც შეინახავთ თქვენს სახელს, შემდეგ კი დაპრინტეთ.
name = "Nikolozi"
print(name)

# 2. შექმენით ცვლადი, სადაც შეინახავთ თქვენს ასაკს, შემდეგ კი დაპრინტეთ.
age = "14"
print(age)

# 3. შექმენით ორი ცვლადი, ორივეში შეინახეთ განსხვავებული რიცხვები, შემდეგ ისინი ერთმანეთს დაუმატეთ პრინტშივე.
number = 27
number1 = 39
print(number + number1)

# 4. შექმენით ორი ცვლადი, ორივეში შეინახეთ განსხვავებული სახელები, შემდეგ ისინი ერთმანეთს დაუმატეთ პრინტშივე.
name1 = "Giorgi"
name2 = "Soso"
print(name1 + " " + name2)