# 1. შექმენი ცვლადი, სადაც შეინახავ სტრინგს, შემდეგ გამოიტანე იმ სტრინგის მეორე ასო.

str = 'Keyboard'
print(str[1])

# 2. შექმენით 2 int ტიპის ცვლადი და გამოიტანეთ მათი ჯამი.

a = 5
b= 10

print(a+b)

# 3. შექმენით 2 str ტიპის ცვლადი და გამოიტანეთ მათი შეერთებული ვერსია

str1 = 'Kit'
str2 = 'Kat'

print(str1 + str2)

# 4. შექმენით 2 int ტიპის ცვლადი და გამოიტანეთ მათი განაყოფი,
#  შემდეგ კი ახსენით რატომ გამოიტანა floatი და რა ქვია ამ convert'ს (implicit or explicit)

x = 9
y = 3

print(9/3)

#პითონში, როდესაც ყოფთ ორ მთელ რიცხვს / ოპერატორის გამოყენებით, შედეგი ყოველთვის არის float.

# 5. გაიხსენეთ ყველა შედარების ოპერატორი და ჩამოწერეთ ყველაზე 1 მაგალითი

n = 10
g = 5

print(n>g)
print(n<g)
print(n==g)
print(n>=g)
print(n<=g)
print(n!=g)

# 6. შეურიეთ შედარების ოპერატორები და მათემატიკური ოპერაციები (მაგ: 5 + 5 == 8  + 2)

print(50 + 7 > 44 + 4)

# 7. გაიხსენეთ ლოგიკური ოპერატორი და ჩამოწერეთ ყველა კომბინაცია რაც საჭიროა (სულ უნდა იყოს რვა, გაიხსენეთ ნასწავლიდან)

True and True
True and False
False and True
False and False

True or True
True or False
False or True
False or False

# 8. შეურიეთ ერთმანეთს ლოგიკური და შედარების ოპერატორები და მოიყვანეთ 5 მაგალითი

i = 7

print(a > 6 and a < 8)

print(a > 5 and a < 6)

print(a > 8 and a < 5)

print(a > 9 and a < 1)

print(a > 6 or a < 8)

# 9. შექმენით for loop'ი 1-დან 10-მდე რიცხვების დასაბეჭდად.

for i in range(10):
    print(i)

# 10. შექმენით რიცხვების list'ი, შექმენით for loop'ი list'ის რიცხვების ჯამის გამოსათვლელად.

nums = [5,6,7,8,9]
total = 0
for i in nums:
    total += i
print(total)

# 11. შექმენით for loop'ი თითოეული სიმბოლოს დასაბეჭდად სტრინგში -> "Hello, World!".

for i in "Hello, World!":
    print(i)

# 12. შექმენით while loop'ი 1-დან 10-მდე რიცხვების დასაბეჭდად.

h = 1
while h <= 10:
    print(h)
    h += 1

# 13. შექმენით while loop'ი რომელიც დათვლის რიცხვებს 1დან 100მდე თუმცა გამოტოვებს რიცხვებს 50დან 60მდე.

i = 1
while i < 100:
    if i < 50 or i > 60:
        print(i)
    i += 1

# 14. შექმენით while loop'ი, რომელიც დაიწყებს რიცხვების შეკრებას 1-დან, სანამ ჯამი არ გაუტოლდება 50-ს.

total1 = 0
d = 1
while total1 < 50:
    total1 += d
    d += 1
    print(total1)
