# 1. კომენტარების მეშვეობით ახსენი რა არის float/integer/string (by data fofxadze).

# float არის მაგალითად 3.14, 7,23, 9.23.
# integer არის მაგალითად 2,3,4,7,8 და ა.შ
# string არის მაგალითად "Nikolozi"

# 2. შექმენით ცვლადი სახელად name, სადაც მომხმარებელს input-ის მეშვეობით შემოატანინებთ სახელს,
#  შემდეგ კი მისალმების მესიჯი, მაგალითად 'hello ' + (სახელი) (by data fofxadze).

name = input("Your Name:")
print(f"Hello My Glorius King {name}")

# 3. შექმენით სამი ცვლადი, სამივეში შეინახეთ განსხვავებული ინფორმაციის ტიპები, შემდეგ კი დაპრინტეთ ისინი.

Club = "Barcelona"
Leauge = "Champions League"
Num = 4

print(f"{Club} has {Num} {Leauge}")

# 4. შექმენით ცვლადი სახელად user_name, სადაც მომხარებელს შემოატანინებთ სახელს,
#  შემდეგ შექმენით ცვლადი სახელად last_name, სადაც მომხმარებელს შემოატანინებთ გვარს,
#  ბოლოს დაუპრინტეთ მსგავსი მესიჯი: 'hello ' + (სახელი) + (გვარი).

user_name = input("Your Name:")
last_name = input("Your Last Name:")

print(f"Hello {user_name} {last_name}")

# 5. კომენტარში ახსენით რა არის input და output, შემდეგ ახსენით რა არის კარგი პრაქტიკები და რომელი კარგი პრაქტიკები ვიცით.

# input არის ასე ვთქვათ მიცემული "დავალება" ხოლო output უკვე შესრულებული/გამოტანილი "დავალება"
# კარგი პრაქტიკები არის მაგალითად 1. კოდის დაკომენტარება. 