# 1. შექმენით for loop()-ი, სადაც გამოიტანთ ციფრებს 5-იდან 15-მდე.

for i in range(5, 15):
    print(i)

# 2. შექმენით for loop()-ი, სადაც გამოიტანთ ციფრებს 5-იდან 15-მდე, 2-ის გამოტოვებით.

for i in range(5, 15, 2):
    print(i)

# 3. შექმენით for loop()-ი, სადაც გამოიტანთ 5-იდან 15-მდე ციფრებს, უბრალოდ თითოეული უნდა იყოს 1-ით მეტი.

for i in range(5, 15):
    print(i+1)

# 4. კომენტარებით ახსენით, თუ როგორ მუშაობს for loop().

# for loop() გვაძლევს უფლებას დავპრინტოთ რიცხვები (for example: 5-10)
#  შეგვიძ₾ია დავუმატოთ, გამოვაკლოთ ან რამდენიმეს გამოტოვებით დავპრინტოთ რიცხვები

