# 1. შეინახეთ სამი ქალაქის სახელი ცალკე ცვლადში და დაპრინტეთ ისინი.

city1 = "Tbilisi"
city2 = "Gori"
city3 = "Paris"

print(city1 + ' ' + city2 + ' ' + city3)

# 2. შეართეთ ორი სიტყვა (მაგ., სახელი და გვარი) და დაპრინტეთ სრული სახელი.

nick = "Nikolozi"
Lastname = "Girgvliani"

print(nick + " " + Lastname)

# 3. აიღეთ ორი რიცხვი და დაპრინტეთ მათი ჯამი, სხვაობა, ნამრავლი და განაყოფი.

num1 = 10
num2 = 5

print(num1 + num2)
print(num1 - num2)
print(num1 * num2)
print(num1 // num2)

# 4. მიანიჭეთ ერთი ცვლადის მნიშვნელობა მეორეს და დაპრინტეთ ორივე ცვლადი, რომ ნახოთ შედეგი.

num3 = 8
num3 = 9
print(num3 + num3)

# 5. შემოატანინეთ მომხმარებელს მისი საყვარელი ფერი და დაპრინტეთ წინადადება, რომელშიც ეწერება ეს ფერი.

user_input = input("Enter Your Favourite Color: ")
print(user_input)

# 6. შეინახეთ სტრინგი, მთელი რიცხვი და float სამ განსხვავებულ ცვლადში და დაპრინტეთ მათი ტიპები.

num11 = "2"
num12 = 1
num13 = 4.5

print(num11)
print(num12)
print(num13)

# 7. აიღეთ float რიცხვი, გადააკეთეთ იგი მთელ რიცხვად და შემდეგ დაპრინტეთ როგორც ორიგინალური float, ასევე გადაყვანილი მთელი რიცხვად.

# Cant understand "3RR0R"

# 8. შეინახეთ რიცხვი ცვლადში და შეამოწმეთ მისი მონაცემთა ტიპი `type()` ფუნქციით. დაპრინტეთ შედეგი.

nom1 = 6.8
print(type(nom1))

# 9. ორ რიცხვზე შეასრულეთ  არითმეტიკული მოქმედებები (შეკრება, გამოკლება, გამრავლება, გაყოფა) და შედეგები შეინახეთ ცვლადებში. შედეგების დაპრინტეთ.

x1 = 1
x2 = 2

print(x1 + x2)
print(x1 - x2)
print(x1 * x2)
print(x1 // x2)

# 10. აიღეთ სამი სტრინგი და გააერთიანეთ ისინი ერთ წინადადებად. დაბეჭდეთ საბოლოო წინადადება.

k1 = "dog"
k2 = "is"
k3 = 'animal'

print(k1 + " " + k2 + " " + k3)

#    აქ არის კიდევ 6 დავალება, რომლებიც ფოკუსირებულია შედარების ოპერატორებზე პირობითების გამოყენების გარეშე:

# 11. შეინახეთ ორი რიცხვი ცალკეულ ცვლადებში და გამოიყენეთ შედარების ოპერატორები (`<`, `>`, `<=`, `>=`, `==`, `!=`) შედარებისთვის. დაპრინტეთ თითოეული შედარების შედეგი.

l = 5
w = 7

print(l>w)
print(l<w)
print(l>=w)
print(l<=w)
print(l==w)
print(l!=w)

# 12. შექმენით ცვლადები ორი სხვადასხვა ასაკისათვის. გამოიყენეთ შედარების ოპერატორები იმის შესამოწმებლად, არის თუ არა ერთი ასაკი მეორეზე დიდი ან მისი ტოლი. დაპრინტეთ შედეგი.

age1 = 15
age2 = 7

print(age2 >= age2)

# 13. სამ ცვლადს მიანიჭეტ რიცხვითი მნიშვნელობები. გამოიყენეთ შედარების ოპერატორები, რათა შეამოწმოთ არის თუ არა პირველი ცვლადი მეორეზე ნაკლები და თუ მეორე მესამეზე ნაკლები. დაპრინტეთ შედეგები.

w1 = 5
w2 = 6
w3 = 7

print(w1 >= w2 >= w3)

# 14. ცვლადში შეინახეთ ორი სხვადასხვა სტრინგი და შეადარეთ ისინი ტოლობის (`==`) და უტოლობა (`!=`) ოპერატორების გამოყენებით. დაპრინტეთ ამ შედარების შედეგები.

g = 7
h = 8

print(g>=h)
print(g!=h)
