# 1. ცვლადში შეინახე სტრინგი დიდი ასოებით, შემდეგ .lower() ფუნქციის მეშვეობით გადააქციე ცვლადი პატარა ასოებად .

word = 'GIRGONA'
print(word.lower())

# 2. ცვლადში შეინახე სტრინგი პატარა ასოებით, შემდეგ .upper() ფუნქციის მეშვეობით გადააქციე ცვლადი დიდ ასოებად.

word = 'girgona'
print(word.upper())

# 3. ცვლადში შეინახე სტრინგი პატარა ასოებით, შემდეგ .capitalize() ფუნქციის მეშვეობით გადააქციე პირველი ასო დიდ ასოდ.

word = 'iphone'
print(word.capitalize())

#მომხარებელს შემოატანინე სიტყვა, შემდეგ გადააქციე პატარა ასოებად და დაპრინტე.

word1 = input("Enter Word: ")
print(word1.lower())
print(word1.upper())
print(word1.capitalize())

