# 1. შექმენი ფუნცია, სადაც არგუმენტად გადასცემ ორ რიცხვს, შემდეგ დაპრინტე ამ ორი რიიცხვის განაყოფი.

def div(num1, num2):
    print(num2 / num1)
div(2,50)

# 2. შექმენი ფუნქცია, სადაც არგუმენტად გადასცემ სახელს, შემდეგ დაპრინტე მისალმების მესიჯი, სადაც ამ სახელს გამოიყენებ.

def name1(name):
    print("Hello Mr." + name)
name1("nika")

# 3. შექმენი ფუნქცია, სადაც არგუმენტად გადასცემ დაბადების თარიღს, შემდეგ დაპრინტე თუ რამდენი წლისაა მომხმარებელი.

def dat3(date):
    print(5 * date)
dat3(29)

# 4. შექმენი ფუნქცია, სადაც არგუმენტად გადასცემ რიცხვ, შემდეგ დაპრინტე ეს რიცხვი გამრავლებული 5-ზე.

def num(nuum):
    print(5 * nuum)
num(97)

# 5. შექმენი ფუნქცია, სადაც პირველ არგუმენტად input()-ის გამოყენებით გადასცემ ასაკს, მეორე არგუმენტად
#  კი input()-ის გამოყენებით გადასცემ სახელს, შემდეგ დაპრინტე, თუ რა ქვია მომხმარებელს და რამდენი წლის არის ის.

def user1(age, name):
    print(f"მომხმარებლის სახელი არის {name} და ის არის {age} წლის.")

age = input("Enter Your Age: ")
name = input("Enter Your Name: ")
user1(age, name)
