# Easy:
# 1.  ჩამოთვალე და კომენტარების მეშვეობით ახსენი პითონში არსებული 3 ინფორმაციის ტიპი (int, float, str).

# float არის მაგალითად 3.14, 7,23, 9.23. # integer არის მაგალითად 2,3,4,7,8 და ა.შ # string არის მაგალითად "Nikolozi"

# 2. შექმენი 3 ცვლადი, სამივეში შეინახე განსხვავებული ინფორმაციის ტიპები, საბოლოოდ type() ფუნქციის გამოყენებით დაპრინტე მათი ტიპები.

name = "Nikolozi"
age = 14
sport = "Football"

print(type(name))
print(type(age))
print(type(sport))

# 3. მომხმარებელს Input()-ით შემოატანინე 2 რიცხვი და ამ ორ რიცხვზე გააკეთე გაყოფა, გამრავლება, მიმატება, გამოკლება (By Ilia Dzindzibadze).

num1 = input()
num2 = input()

print(int(num1)//int(num2))
print(int(num1)*int(num2))
print(int(num1)+int(num2))
print(int(num1)-int(num2))

# Medium:
# 3. შექმენი ცვლადი, რომელშიც თავიდან შეინახავ "5"-ს, შემდეგ ეს ცვლადი გადააქციე integer-ად და დაპრინტე.

num3 = "5"
print(int(num3))

# 4. შექმენი ცვლადი, რომელშიც თავიდან შეინახავ 6-ს, შემდეგ ეს ცვლადი გადააქციე float-ად და დაპრინტე (By Ilia Dzindzibadze).

num4 = 6
print(float(num4))

# 5. დაწერე კოდი, სადაც გამოიყენებ ორივე ტიპის გაყოფას (/ და //), დააკვირდი რა განსხვავებაა მათ შორის და დაწერე კომენტარში.

print(10/2)
print(10//2)

# როდესაც ვიყენებთ / მაშინ ტერმინალზე გამოდის float ხოლო როცა ვიყენებთ // მაშინ გამოდის integer

# Hard:
# 6. მომხმარებელს input()-ით შემოატანინე ასაკი და ბოლოს დაუპრინტე, თუ რამდენი წლის იქნება 5 წლის შემდეგ (By Ilia Dzindzibadze).

age = input("Your Age:")
print(int(age) + 5)

# 7. შექმენი 2 ცვლადი, პირველში მომხარებელს input()-ით შემოატანინე მისი სახელი, მეორეში გვარი, საბოლოოდ დაუპრინტე მისალმების მესიჯი,
#  მაგალითად: 'გამარჯობა' + (სახელი) + (გვარი).

user_name = input("Your Name:")
last_name = input("Your Lastname:")

print(f"Hello {user_name} {last_name}")
