# 1. შექმენით სია, სადაც გექნებათ სიტყვები, შემდეგ გამოიტანეთ სათითაოდ ყველა სიტყვა.

list = ['Kaci', 'Qali', 'Bavshvi', 'Barcelona']

for list in list:
    print(list)

# 2. შექმენით სია, სადაც გექნებათ 5 ცალი რიცხვი, შემდეგ გამოიტანეთ სათითაოდ ყველა რიცხვი.

num = [1, 2, 3, 4, 5]

for num in num:
    print(num)

# 3. შექმენით სია, სადაც გექნებათ` 5 ცალი რიცხვი, შემდეგ გამოიტანეთ სათითაოდ ყველა რიცხვი გამრავლებული თავის თავზე.

num = [1, 2, 3, 4, 5]

for num in num:
    print(num * num)

# 4. შექმენით სია, სადაც გექნებათ 5 ცალი რიცხვი, შემდეგ ეს ციფრები გააორმაგეთ და დაამატეთ ახალ სიაში.

num2 = [1, 2, 3, 4, 5]

double_nums = []

for num2 in num2:
    double_nums.append(num2 * 2)

print(double_nums)