#1. შექმენით ცვლადი, რომლის სახელიც არის ორი სიტყვა და შიგნით შეინახეთ სტრინგი, შემდეგ დაპრინტეთ ეს ცვლადი და ბოლოს ყველაფერი ახსენით კომენტარებით.

Footballer_Name = 'Lionel Messi'
print(Footballer_Name)

# ამ კოდში შევქმენი ორ სიტყვიანი ცვლადი და შევინახე სახელი (str) შემდეგ კი გავუშვი ეს კოდი

#2. გააკეთეთ 5 მაგალითი მათემატიკურ ოპერაციებზე, პრინტის მეშვეობით: print(5 + 3)

print(4+9)
print(9-4)
print(9*4)
print(10/5)
print(15//5)

# 3. შექმენით 2 ცვლადი, სადაც შეინახავთ რიცხვებს და საბოლოოდ დაპრინტეთ ამ ორ ცვლადს შორის 4-ივე არითმეტიკული ოპერაცია.

num1 = 100
num2 = 5

print(num1 + num2)
print(num1 - num2)
print(num1 * num2)
print(num1 // num2)